#include <iostream>
#include "menu.h"

using namespace std;

void print1Menu(){
    cout<<"======================================================================="<<endl;
    cout<<"0 --- Выйти из программы"<<endl;
    cout<<"1 --- Показать содержание таблицы"<<endl;
    cout<<"2 --- Включить нового ученика"<<endl;
    cout<<"3 --- Найти ученика по индивидуальному шифру"<<endl;
    cout<<"4 --- Удалить ученика по индивидуальномк шифру"<<endl;
}

void print2Menu(){
    cout<<"======================================================================="<<endl;
    cout<<"1 ----- Вывести информацию о студенте"<<endl;
    cout<<"2 ----- Категория студента"<<endl;
    cout<<"3 ----- Оценки"<<endl;
    cout<<"4 ----- Записать оценки"<<endl;
    cout<<"5 ----- Изменить индекс группы"<<endl;
    cout<<"6 ----- Перевести студента в другую категорию"<<endl;
}

void printExtraMenu(){
    cout<<"7 ----- Тема УИР/ДП"<<endl;
    cout<<"8 ----- Изменить тему УИР/ДП"<<endl;
    cout<<"9 ----- Место выполнения УИР/ДП"<<endl;
    cout<<"10 ---- Изменить место выполнения УИР/ДП"<<endl;
}

int input_int(){
    int a = 0;
    while(!(cin >> a).good()){
        cout << "Неправильно введено число. Попробуйте ещё раз.\n";
        //std::cin.clear();
        //std::cin.ignore(1000, '\n');
    }
    cin.clear();
    cin.ignore(1000, '\n');
    return a;
}